Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: དེ་ལྟ་བུའི་གླུའི་དབྱངས་ལེན་པ་དང་། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པར་གསུང་གིས་གོ་བར་མཛད་ནས་སངས་རྒྱས་ཀྱི་མཐུ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་བརླབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དག་ན་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་རྒྱ་མཚོ་ཆེན་པོར་གཤེགས་པ་མཐོང་ངོ་།
en: After this kind of song and his speech were heard throughout countless buddha realms throughout the ten directions, bodhisattvas, śakras, brahmās, world protectors, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans living in other worlds saw the Blessed Thus-Gone One Śākyamuni enter the ocean through the power of the Buddha and the blessing of the Thus-Gone One.

source: །དེ་ན་ལྷའི་བུ་མོ་དང་། ཀླུའི་བུ་མོ་དང་། གནོད་སྦྱིན་གྱི་བུ་མོ་དང་། ལྷ་མ་ཡིན་གྱི་བུ་མོ་དང་། ནམ་མཁའ་ལྡིང་གི་བུ་མོ་དང་། དྲི་ཟའི་བུ་མོ་དང་། མིའམ་ཅིའི་བུ་མོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བུ་མོ་བྱེ་བ་ཕྲག་འབུམ་དག་གིས་སིལ་སྙན་དང་། གླུའི་དབྱངས་ལེན་ཅིང་བཅོམ་ལྡན་འདས་མདུན་ནས་བསུ་ནས་དེའི་ཚེ་རྒྱུད་ཀྱི་སྒྲ་སྐད་ལས་འབྱུང་བའི་ཚིགས་སུ་བཅད་པ་ཁྱད་པར་དུ་འཕགས་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་པ།
en: Trillions of goddesses, nāgas, yakṣas, asuras, garuḍas, gandharvas, kinnaras, and mahoragas played instruments and sang songs, inviting the Blessed One from on ahead. From the sound of the strings arose these extraordinary verses in praise of the Blessed One:

source: སྦྱིན་པ་ལས་བྱུང་ཚུལ་ཁྲིམས་མཛེས་དང་ལྡན།
en: “O you who have arisen from generosity, who are beautified by discipline,

source: །བཟོད་པའི་སྟོབས་ལས་བྱུང་བ་བྱམས་པ་བསྒོམས།
en: You have cultivated love summoned from the strength of patience.

source: །བརྩོན་འགྲུས་ལས་བྱུང་དོན་གྱི་རྒྱ་མཚོ་ལས།
en: You are the true ocean arisen from diligence.

source: །བསམ་གཏན་རྣམ་ཐར་དགྱེས་པ་ཁྱོད་ཕྱག་འཚལ།
en: O concentration, liberation, and joy—to you we prostrate!

source: །ཤེས་རབ་འོད་ལྡན་དགོངས་པ་རྣམ་པར་དག །འོད་དང་གཟི་བརྗིད་དཔལ་གྱིས་མངོན་པར་བརྒྱན།
en: “Illuminated with insight, with purified intent, Adorned with the glory of light and splendor,

source: །རྣམ་པར་གྲོལ་བ་མངོན་སུམ་སྟོན་མཛད་པ།
en: Directly pointing out liberation,

source: །ཐུབ་པ་ཉོན་མོངས་བསལ་ལ་ཕྱག་འཚལ་ལོ།
en: O Sage, dispeller of affliction—to you we prostrate! “You have perfect and supreme ascetic discipline;

source: །བརྟུལ་ཞུགས་ཤིན་ཏུ་རྫོགས་པ་བརྟུལ་ཞུགས་མཆོག །དཀའ་ཐུབ་མཐར་ཕྱིན་རྟོགས་པར་ཐུགས་སུ་ཆུད།
en: You have completed austerity and mastered realization.

source: །མིག་ནི་སྦྱིན་པར་མཛད་ཅིང་མིག་སྦྱོང་བ།
en: Having given away your eyes, they are purified. O mendicant among beings, you are the greatest among them.

source: །འགྲོ་བ་ཀུན་ཏུ་རྒྱུ་བ་འགྲོ་བའི་མཆོག །དོན་དམ་ཟབ་མོ་ཤིན་ཏུ་སྟོན་པ་པོ།
en: “Extraordinary teacher of the profound ultimate truth,

source: །གཞན་ལ་ཕན་པ་ཟླ་མེད་ཐུགས་སུ་ཆུད།
en: You who have mastered the incomparable benefit of others.

source: །ཆགས་པ་མེད་པར་ཚིག་གི་དོན་སྟོན་པ།
en: Revealing the meaning of words without obstruction,

source: །གཞན་ལ་ཕན་པ་དཔེ་མེད་འོད་མཛད་པ།
en: You are an illuminator whose benefit for others has no analogy.

source: །དུས་སྐབས་མཁྱེན་པ་ཀུན་ཏུ་སྟོན་པ་པོ།
en: “O knower of time, you reveal all.

source: །རྒོལ་བ་ངན་པའི་ཚོགས་ཀུན་རབ་འཇོམས་པ།
en: You defeat all throngs of evil opponents.

source: །བརྟུལ་ཞུགས་ཡོངས་སུ་རྫོགས་པ་བརྟུལ་ཞུགས་མཆོག །བདུད་རྩིའི་བདེ་སྐྱིད་བདེ་བ་སྦྱིན་མཛད་པ།
en: Perfect in ascetic discipline, with supreme ascetic discipline You bestow bliss—the nectar of joyfulness.

source: །ནམ་མཁའ་འདྲ་ཞིང་དགོངས་པ་དག་པ་སྟེ།
en: “You whose intent is pure like space,

source: །དྲི་མ་ཀུན་སེལ་རྣམ་པར་འདྲེན་པ་པོ།
en: Ultimate guide who clears away all stains,

source: །ཡོན་ཏན་རྒྱ་མཚོ་བསོད་ནམས་མི་ཟད་པ།
en: Ocean of qualities whose merit is inexhaustible,

source: །རྒྱ་མཚོར་འཇུག་པ་ཡེ་ཤེས་རྒྱ་མཚོར་ལྡན།
en: As you enter the ocean, you possess an ocean of wisdom.

source: །ཆོས་ཀྱི་དབང་ཕྱུག་ཉོན་མོངས་སེལ་མཛད་པ།
en: “O master of Dharma who dispels afflictions,

source: །ཆོས་ཀྱི་སྦྱིན་བདག་སེར་སྣ་མི་མངའ་བ།
en: Patron of the Dharma who harbors no stinginess,

source: །ཆོས་ཀྱི་རིན་ཆེན་ནོར་མཆོག་སྦྱིན་མཛད་པ།
en: Jewel of Dharma who bestows supreme wealth,

source: །ཆོས་མཆོག་ཡེ་ཤེས་དེ་ཉིད་སྟོན་པ་པོ།
en: Supreme Dharma, you are the teacher of the wisdom of thusness.

source: །དགའ་བ་སྟོན་པ་བདེ་བ་སྟོན་མཛད་པ།
en: “O teacher of joy who makes bliss manifest,

source: །བག་ལ་ཉལ་གྱི་ཉེས་པ་སྤོང་བ་སྟོན།
en: Who shows how to remove latent flaws

source: །རི་ཡི་དབང་པོ་བཞིན་དུ་མི་གཡོ་བ།
en: And remains stable like the king of mountains,

source: །དེ་བཞིན་གཤེགས་པ་ཁྱོད་ལ་མགོས་ཕྱག་འཚལ།
en: We bow our heads to you, Thus-Gone One.

source: །མི་དང་ལྷ་དང་མཁའ་ལྡིང་གསང་བ་པ།
en: “The lords of the humans, gods, garuḍas, guhyakas, Asuras, rākṣasas, and kinnaras,

source: །ལྷ་མིན་སྲིན་པོ་མིའམ་ཅི་ཡི་བདག །ཀླུ་རྣམས་དང་ནི་གྲུལ་བུམ་གནོད་སྦྱིན་རྣམས།
en: The nāgas, kumbhāṇḍas, and yakṣas,

source: །ཁྱོད་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་ཀྱང་འཚལ།
en: All bow their heads to your feet!

source: །མཚན་མཆོག་སུམ་ཅུ་རྩ་གཉིས་ལྡན་པ་སྟེ།
en: “Replete with the thirty-two supreme marks,

source: །རབ་མཛེས་ཤིན་ཏུ་དཔེ་མེད་སྟོན་མཛད་པ།
en: You display beauty for which no analogy is adequate.

source: །གསེར་གྱི་མདོག་ཅན་དཔལ་ལྡན་མདོག་སྡུག་པ།
en: Your complexion is appealing with its gloriously golden hue.

source: །སེན་མོ་ཟངས་འདྲ་མདོག་སྡུག་ཕྱག་མཐིལ་མཉམ།
en: Your fingernails have a beautiful copper-like luster and your palms are even.

source: །ཀ་ལ་པིང་ཀའི་གདངས་ཅན་ཡ་མཚན་གསུང་།
en: “Your speech is miraculous, melodious like the kalaviṅka.

source: །ཚངས་པ་ལྷ་དབང་གདངས་ཅན་གདངས་ཀྱི་མཆོག །གསུང་གིས་སྟོང་གསུམ་སོ་སོར་འགེངས་པར་མཛད།
en: It has the finest timbre of Brahmā, lord of the gods. Your speech reaches the entire trichiliocosm.

source: །འཇམ་མཉེན་གསུང་ལྡན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: O soft and gentle-voiced being—to you we prostrate!

source: །དབང་པོ་དུལ་ཞིང་ཐུགས་ཀྱང་དུལ་བ་སྟེ།
en: “Your faculties are tame, and your mind gentle.

source: །ཞལ་རས་ཟླ་བ་འདྲ་ཞིང་སྤྱན་ལེགས་པ།
en: Your face is like the moon, and your eyes are exquisite.

source: །རྟག་ཏུ་བདེན་པ་གསུང་ཞིང་མཉམ་པར་བཞག །རྟག་ཏུ་ཆོས་འཛིན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: You always speak the truth and remain in equilibrium. Eternal upholder of the Dharma—to you we prostrate!

source: །རྒན་ད་སྡུག་བསྔལ་རབ་ཏུ་གྲོལ་མཛད་པ།
en: “O you who liberate from aging, disease, and suffering,

source: །འགྲོ་བའི་དོན་མཛད་ཉོན་མོངས་སྤོང་མཛད་པ།
en: Who perform the benefit of beings and eliminate the afflictions—

source: །རྒྱལ་བར་འོས་པ་བདུད་འཇོམས་རྒྱལ་བ་པོ།
en: How fitting that you have won, O Victor, destroyer of Māra,

source: །སྐྱེ་བ་མི་བཟད་དེ་ཉིད་སྟོན་མཛད་པ།
en: O unstoppable being who reveals thusness itself.

source: །དགྲ་བཅོམ་དགྲ་ཡི་ཚོགས་རྣམས་རབ་འཇོམས་པ།
en: “O worthy one who has defeated all assembled enemies,

source: །ལྷ་ལས་འདས་པ་ལྷ་མང་རྣམས་ཀྱིས་མཆོད།
en: You are beyond the gods yet venerated by many of them!

source: །ཁྱོད་ནི་རྟག་ཏུ་བཞེས་པའི་འོས་ཀྱི་མཆོག །སྐྱེ་དགུ་ཀུན་མཆོག་འདྲེན་པ་བཟང་པོ་ལགས།
en: You are supreme—always suitable to be accepted.

source: །དེ་ནས་ལྷའི་བུ་མོ་དང་། ཀླུའི་བུ་མོ་དང་། ལྷ་མ་ཡིན་དང་། མིའམ་ཅི་དང་། ནམ་མཁའ་ལྡིང་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། དྲི་ཟའི་བུ་མོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་རྣམས་ཀྱིས་མངོན་པར་བསྟོད་ནས་ཐམས་ཅད་གཅིག་ཏུ་འཐུན་པར་གྱུར་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་རང་རང་གི་རྒྱན་རྣམས།
en: You are an excellent guide—supreme among all types of beings.” Once these goddesses, nāgas, asuras, kinnaras, garuḍas, mahoragas, and gandharvas offered the Blessed One these verses of praise, they all together developed the mind set on unsurpassed and perfect awakening, and each adorned the body of the Blessed One with their respective ornaments.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གསོལ་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་མཐར་གྱིས་རྒྱ་མཚོ་ཆེན་པོར་གཤེགས་ཏེ། རྒྱ་མཚོ་ཆེན་པོའི་གཏིང་གི་དཀྱིལ་གྱི་གནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་འཁོར་གྱི་ཁྱམས་བཀོད་པ་ག་ལ་བ་དེར་གཤེགས་ནས། སེང་གེའི་ཁྲི་དེ་ལ་བཞུགས་སོ།
en: Finally, the Blessed One traveled to the depths of the ocean where the courtyard of the Nāga King Sāgara had been made ready, taking his seat on the lion throne.

source: །དགེ་སློང་གི་དགེ་འདུན་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་སྟན་ཇི་ལྟར་བཤམས་པ་དེ་དག་ལ་འཁོད་དོ།
en: The saṅgha of monks and the bodhisattvas arranged themselves on the seats that had been prepared for them.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བཞུགས་པར་རིག་ནས་བུ་དང་བཅས། ཆུང་མ་དང་བཅས། གཉེན་འདབ་དང་འཁོར་དང་བཅས་པས་རང་གི་ལག་གིས་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ། བསོད་པ་མང་པོས་ཚིམ་པར་བྱེད་ཅིང་ཅི་བཞེས་པ་སྟོབས་པར་བྱེད་དོ།
en: Seeing that the Blessed One, his saṅgha of monks, and the bodhisattvas had taken their seats, Nāga King Sāgara and his children, wives, relatives, and retinue themselves served a feast of whatever they desired, satisfying them with many tastes and many excellent aspects.

source: །ཚིམ་པར་བྱས་ཤིང་ཅི་བཞེས་པ་བསྟབས་ནས་བཤོས་གསོལ་ལགས་ཏེ།
en: When this delicious and satisfying food had been distributed, they took their meal.

source: བསྩང་ལྡེར་གྱུ་བ་དང་ཕྱག་བཅབས་པར་རིག་ནས་ཆོས་མཉན་པའི་ཕྱིར་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་དང་། ཕྱོགས་བཅུ་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ།
en: Once Nāga King Sāgara saw that the Blessed One had cleaned his bowl and washed his hands, the king and the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, śakras, brahmās, world protectors, and bodhisattva great beings who had gathered from the ten directions arranged themselves before the Blessed One to hear him preach the Dharma.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ཚོགས་ཏེ་འཁོད་པར་ཐུགས་སུ་ཆུད་ནས་བདེ་བ་དང་། དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བའི་ཆོས་མཉན་པ་ཞེས་བྱ་བའི་འོད་ཟེར་སྐུ་ལས་འགྱེད་པར་མཛད་དེ།
en: When the Blessed One saw that the entire assembly had gathered, he emitted from his body light rays called the blissful, pleasing, and supremely joyful hearing of Dharma

source: འོད་ཟེར་དེ་དག་གིས་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་སྲོག་ཆགས་རབ་དང་། འབྲིང་དང་། ཐ་མ་ཇི་སྙེད་གནས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་མདུན་ན་བཞུགས་པར་མཐོང་བར་གྱུར་ཏེ། བདེ་བ་དང་། དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་སྐྱེས་ནས་ཆོས་མཉན་པ་ལ་བྲོད་ཅིང་གུས་པ་དང་བཅས་པས་ཐལ་མོ་སྦྱར་ཏེ།
en: These light rays allowed all the greater, lesser, and middling beings in the ocean to behold the Blessed One seated before them, which aroused in them bliss, pleasure, and supreme joy. They joined their hands respectfully, eager to hear the Dharma.

source: བཅོམ་ལྡན་འདས་ལ་འདུད་ཅིང་འཁོད་པར་གྱུར་ཏོ།
en: Arrayed there, they bowed before the Blessed One.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་འཇིག་རྟེན་གནས་པ་འདི་ནི་ལས་སྣ་ཚོགས་ཀྱིས་བསྐྱོད་ནས།
en: The Blessed One then addressed Nāga King Sāgara, “Nāga Lord, this world is moved by myriad actions.

source: སེམས་ཀྱི་དམིགས་པ་སྣ་ཚོགས་ཀྱིས་ལས་རྣམ་པ་སྣ་ཚོགས་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་བྱེད་དེ།
en: These actions lead to myriad mental observations that again create myriad actions, and the beings that result from them are also myriad.

source: དེའི་འགྲོ་བ་ཡང་སྣ་ཚོགས་སུ་གྱུར་ཏོ། །ཀླུའི་བདག་པོ་རྒྱ་མཚོ་ཆེན་པོ་འདི་ན་གཟུགས་རྣམ་པ་སྣ་ཚོགས་ཇི་སྙེད་ཡོད་པ་དང་། ཐ་མལ་པ་ཇི་སྙེད་སྣང་བ་ལ་ལྟོས།
en: Nāga Lord, consider for instance the diversity of life forms in this ocean and the diversity of ordinary beings.

source: ཀླུའི་བདག་པོ་འདི་དག་ཐམས་ཅད་ནི་རང་རང་གི་སེམས་དང་། དགེ་བ་དང་མི་དགེ་བའི་རྩ་བའི་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་སྣ་ཚོགས་ཀྱིས་སྣ་ཚོགས་སུ་བྱས་པ་དག་གོ།
en: Nāga Lord, the whole gamut of these is caused by their individual minds and their various physical, verbal, and mental roots of virtue and nonvirtue.

source: །སེམས་ནི་གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ་སྟེ།
en: The mind is formless and cannot be pointed out.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་ན་ཆོས་ཐམས་ཅད་ནི་བཅོས་མ་རྣམ་པར་བསྒྲུབས་པས་ཉེ་བར་གནས་པའི་མཚན་ཉིད་དེ།
en: For this reason, Nāga Lord, all phenomena are characterized as fictitious creations.

source: བདག་པོ་མེད་པ་བདག་གི་མེད་པ། ཡོངས་སུ་འཛིན་པ་མེད་པའོ།
en: As such, they are unowned, unpossessed, and ungraspable.

source: །དེ་དག་ནི་ལས་ཇི་ལྟར་བསགས་པ་བཞིན་དུ་བསྒྲུབས་པ་སྣ་ཚོགས་སུ་བྱས་པ་དག་སྟེ།
en: They only manifest in various ways according to accumulated karma;

source: འདི་ལ་བྱེད་པ་པོ་གང་ཡང་མེད་དོ།
en: there is no creator of them at all.

source: །དེ་ལྟར་ན་ཆོས་འདི་དག་ནི་བསམ་གྱིས་མི་ཁྱབ་པ། སྒྱུ་མའི་མཚན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: In this way, such phenomena are unfathomable and nothing more than illusions.

source: །ཀླུའི་བདག་པོ་དེ་ལ་མཁས་པས་ཆོས་ཐམས་ཅད་རྣམ་པར་བསྒྲུབས་པས་ཉེ་བར་གནས་པའི་མཚན་ཉིད་དུ་ཤེས་ནས་དགེ་བ་མངོན་པར་འདུ་བྱ་བ་དག་ཁོ་ན་མངོན་པར་འདུ་བྱ་སྟེ།
en: “Nāga Lord, becoming learned in this, one knows that all phenomena are characterized as existing due to such production.

source: དགེ་བ་མངོན་པར་འདུ་བྱ་བ་དག་མངོན་པར་འདུ་བྱེད་པའི་ཕུང་པོ་དང་། ཁམས་དང་སྐྱེ་མཆེད་རྣམ་པར་བསྒྲུབས་ནས་ཉེ་བར་གནས་པའི་མཚན་ཉིད་མངོན་པར་འགྲུབ་པ་གང་ཡིན་པ་དེ་དག་མཛེས་ཤིང་གཟུགས་བཟང་ལ་བལྟ་ན་སྡུག་པར་མངོན་པར་འགྲུབ་པར་འགྱུར་རོ།
en: Knowing this, one will go on to create nothing but virtue. The resulting characteristics of the aggregates, elements, and sense sources that manifest due to such virtuous actions are such that one gains a beautiful and fine appearance with a lovely countenance.

source: །ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པའི་སྐུ་བསོད་ནམས་བྱེ་བ་ཕྲག་འབུམ་གྱིས་ཇི་ལྟར་བརྒྱན་པ་དང་། ཇི་ལྟར་རྣམ་པར་བསྒྲུབས་པ་དང་། གང་གི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་ནོན་པར་འདུག་པ་དང་། གང་གིས་འབུམ་ཕྲག་བཅུ་ལ་དབང་སྒྱུར་བའི་ཚངས་པ་འདི་དག་ཀྱང་མོག་མོག་པོར་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་བལྟ་བ་ན་ཡང་མིག་ཁྲལ་ཁྲུལ་དུ་གྱུར་པ་ལ་ལྟོས།
en: “Nāga Lord, consider how the body of the Thus-Gone One is adorned and displayed due to billions of merits, how the world and its gods are overwhelmed by it and are under its control, how it eclipses even Brahmā, who rules over billions, and how if one gazes at the body of the Thus-Gone One, one’s eyes will be overwhelmed.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་གི་ལུས་ཀྱི་རྒྱན་གཟུགས་ཀྱི་མཚན་རྣམས་ལ་ལྟོས།
en: Consider the ornaments of the bodies and physical marks of these bodhisattva great beings.

source: འདི་དག་ཐམས་ཅད་ནི་དགེ་བ་མངོན་པར་འདུ་བྱེད་པས་མངོན་པར་འདུས་བྱས་པ་བརྒྱན་པ།
en: All of these are collected, adorned, and displayed due to the accumulation of virtue.

source: རྣམ་པར་བསྒྲུབས་པ་དག་གོ། །ཀླུའི་བདག་པོ་ཁྱོད་ཀྱི་བཀོད་པ་འདི་ཡང་བསོད་ནམས་ལས་བྱུང་བ་ཡིན་ནོ།
en: “Nāga Lord, your array, too, has arisen from merit.

source: །བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་འདི་རྣམས་ཀྱི་བཀོད་པ་འདི་དག་ཐམས་ཅད་ཀྱང་བསོད་ནམས་ལས་བྱུང་བ་དག་གོ།
en: The arrays of these śakras, brahmās, world protectors, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas have also arisen from merit.

source: །ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ཆེན་པོ་འདི་ན་གང་དག་ལུས་སྣ་ཚོགས་གཟུགས་མི་སྡུག་ཅིང་དབྱིབས་མི་ལེགས་པ་དང་། ལུས་རགས་ཤིང་ཆེ་བ་རྣམས་དང་། གང་དག་ལུས་ཕྲ་ཞིང་ཆུང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རང་རང་གི་སེམས་དང་། དགེ་བ་དང་མི་དགེ་བའི་རྩ་བའི་ལུས་དང་ངག་དང་། ཡིད་ཀྱི་ལས་སྣ་ཚོགས་ཀྱིས་སྣ་ཚོགས་སུ་བྱས་པ་དག་སྟེ།
en: Nāga King, the various bodies in this ocean that are ugly in form, poorly shaped, large and ungainly, or small and feeble are all fashioned in their multiplicity by the individual minds of beings and their various physical, verbal, and mental roots of virtue and nonvirtue.

source: ཀླུའི་བདག་པོ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་ལས་བདག་གིར་བྱ་བ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པར་འགྱུར་བ་དེ་ལྟར་སློབས་ཤིག་དང་། ལས་བདག་གིར་བྱ་བ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པ་ཁྱེད།
en: Therefore, Nāga Lord, you must learn to take responsibility for your own actions and accept that hose actions will come to fruition.

source: དགེ་བའི་ལས་མངོན་པར་འདུ་བྱ་བ་དག་ལ་བློ་འཇུག་པར་འགྱུར་རོ།
en: When you take responsibility for your own actions and accept that those actions will come to fruition, your mind will engage in the virtuous actions that should be accumulated.

source: །ལྟ་བ་ཆུད་གསོན་པར་བྱེད་པར་མི་འགྱུར་རོ།
en: You will not squander your view.

source: །ཆད་པར་ལྟ་བ་དང་། རྟག་པར་ལྟ་བ་ལ་གནས་པར་ཡང་མི་འགྱུར་རོ།
en: You will not be stuck in either the view of eternalism or the view of nihilism.

source: །ཁྱོད་ཀྱིས་སྦྱིན་པའི་གནས་རྣམས་མཉེས་པར་གྱིས་ཤིག །མཉེས་པར་བྱས་ནས་ཀྱང་ཐུགས་ཕྱུང་བར་མ་བྱེད་ཅིག །བཀུར་སྟིའི་རྒྱུ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱེད་པས་ཀྱང་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་བཀུར་སྟིའི་གནས་སུ་འགྱུར་བར་གྱིས་ཤིག། །།བམ་པོ་ལྔ་པ།
en: You must please those who are worthy recipients of generosity; once you have pleased them, you must not become discouraged. By accumulating the roots of virtue that arise through veneration, you will become the object of service for the world and its gods.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་གཅིག་གིས་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བར་སྐྱེ་བ་ཡང་དག་པར་གཅོད་དོ།
en: “Nāga Lord, through a single practice, bodhisattvas prevent themselves from falling into the lower realms and painful destinies.

source: །ཆོས་གཅིག་པོ་དེ་གང་ཞེ་ན།
en: What is this one practice?

source: འདི་ལྟ་སྟེ། བདག་ཇི་ལྟར་གྱུར་ཅིང་ཉིན་མཚན་རྣམས་འདའ་ཞིང་འདུག་སྙམ་དུ་དགེ་བའི་ཆོས་རྣམས་ལ་སོ་སོར་རྟོག་པ་སྟེ།
en: It is to assess their virtuous qualities, wondering both day and night how they themselves are.

source: དེ་དགེ་བའི་ཆོས་ལ་སོ་སོར་རྟོག་པ་མང་བས་མི་དགེ་བའི་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱི་གོ་སྐབས་མི་འབྱེད་དོ།
en: By repeatedly monitoring their virtuous qualities, they prevent nonvirtuous attitudes or mental states from occurring.

source: །དེ་མི་དགེ་བའི་ཆོས་སྤངས་ཏེ་དགེ་བའི་ཆོས་དང་ལྡན་པས་བསམ་པ་དགེ་བའི་སེམས་ཅན་འདི་ལྟ་སྟེ།
en: Thus they abandon nonvirtuous qualities and accrue virtuous qualities instead.

source: སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། འགྲོགས་པ་རྙེད་པར་འགྱུར་རོ།
en: That is what allows such virtuous beings to encounter the buddhas and bodhisattvas.

source: །ཀླུའི་བདག་པོ་དེ་ལ་དགེ་བའི་ཆོས་དེ་དག་གང་ཞེ་ན།
en: “Nāga Lord, what are these virtuous qualities?

source: དགེ་བའི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི་ལྷ་དང་མིའི་སྐྱེ་དགུའི་ཕུན་སུམ་ཚོགས་པའི་རྩ་བའི་རྟེན་ཏོ།
en: Virtuous qualities are the roots that nurture the excellence of human and divine births.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱི་རྩ་བའི་རྟེན་ཏོ།
en: They are the roots that nurture the awakening of the hearers and solitary buddhas.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྩ་བའི་རྟེན་ཏོ།
en: They are the roots that nurture unsurpassed and perfect awakening.

source: །རྩ་བའི་རྟེན་ཀྱང་གང་ཞེ་ན།
en: “What are these nurturing roots?

source: འདི་ལྟ་སྟེ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཏེ།
en: They are the ways of the ten virtues.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these ten?

source: སྲོག་གཅོད་པ་སྤོང་བ་དང་། མ་བྱིན་པར་ལེན་པ་སྤོང་བ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་སྤོང་བ་དང་། བརྫུན་དུ་སྨྲ་བ་སྤོང་བ་དང་། ཕྲ་མ་སྤོང་བ་དང་། ངག་རྩུབ་པོ་སྤོང་བ་དང་། ཚིག་ཀྱལ་པ་སྤོང་བ་དང་། བརྣབ་སེམས་སྤོང་བ་དང་། གནོད་སེམས་སྤོང་བ་དང་། ལོག་པར་ལྟ་བ་སྤོང་བ་སྟེ།
en: They are abandoning taking life, abandoning stealing, abandoning sexual misconduct, abandoning lying, abandoning divisive speech, abandoning harsh speech, abandoning idle chatter, abandoning covetousness, abandoning malice, and abandoning wrong views.

source: དེ་ནི་རྩ་བའི་རྟེན་ཅེས་བྱའོ།
en: These are called the nurturing roots

source: །ཀླུའི་བདག་པོ་དེ་ལ་སྲོག་གཅོད་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་རབ་ཏུ་ཞི་བར་བྱེད་པའི་ཆོས་བཅུ་ཐོབ་སྟེ།
en: “Nāga Lord, regarding this, people who abandon taking life acquire ten qualities that bring about peace.

source: བཅུ་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are these ten? They are as follows:

source: དེས་སེམས་ཅན་ཐམས་ཅད་ལ་མི་འཇིགས་པ་བྱིན་པ་ཡིན།
en: Such people give all beings fearlessness;

source: དེའི་སེམས་བྱམས་པར་དམིགས་པ་ལ་ཉེ་བར་གནས་པ་ཡིན།
en: they keep their minds focused on love;

source: དེའི་ཞེ་སྡང་གི་བག་ཆགས་ཡང་དག་པར་ཆད་པ་ཡིན།
en: their habitual tendencies toward aggression are terminated;

source: དེས་ནད་ཉུང་བར་འགྱུར་བའི་ལམ་ཡོངས་སུ་བཟུང་བ་ཡིན།
en: they adhere to the path of few illnesses;

source: དེས་ཚེ་རིང་བར་འགྱུར་བའི་ས་བོན་བཏབ་པ་ཡིན།
en: they plant the seed of longevity;

source: དེ་ལ་མི་མ་ཡིན་པ་རྣམས་ཀྱང་སྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦེད་པར་བྱེད་པ་ཡིན།
en: they are guarded, protected, and concealed by nonhuman beings;

source: བདེ་བར་ཉལ་ཞིང་བདེ་བར་སད་པ་དང་། སྡིག་པའི་རྨི་ལམ་མི་རྨི་བ་ཡིན།
en: they sleep and rise well, and they do not have evil dreams;

source: གཉིད་ལོག་པ་ན་ཡང་དེ་ལ་ལྷ་རྣམས་སྲུང་བ་ཡིན།
en: when they have fallen asleep they are guarded by gods;

source: དེ་ལ་ཤར་གཉེར་བ་མེད་པ་ཡིན་ཏེ། དེ་ལ་ཤར་གཉེར་བའི་བག་ལ་ཉལ་བ་མེད་པ་ཡིན།
en: there will be no hostility or even latent hostility toward them;

source: ངན་འགྲོ་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་པ་དང་། ཤི་འཕོས་ནས་ཀྱང་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བ་ཡིན་ཏེ།
en: and they have no need to fear any of the lower realms, for when they die they are reborn in the higher, more fortunate realms.

source: རབ་ཏུ་ཞི་བར་བྱེད་པའི་ཆོས་བཅུ་པོ་དེ་དག་འཐོབ་བོ།
en: These are the ten qualities that bring about peace.

source: །སྲོག་གཅོད་པ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། དེས་དེ་བྱང་ཆུབ་ཐོབ་པ་ན་ཚེའི་ཚད་སེམས་ཀྱི་དབང་དུ་འགྱུར་རོ།
en: If the roots of virtue of abandoning taking life are dedicated to unsurpassed and perfect awakening, then when one attains awakening, one’s lifespan will be under the control of one’s mind.

source: །ཀླུའི་བདག་པོ་མ་བྱིན་པར་ལེན་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ཡིད་བརྟན་པའི་ཆོས་ལྔ་འཐོབ་སྟེ།
en: “Nāga Lord, a person who abandons stealing acquires five qualities that bring mental stability.

source: ལོངས་སྤྱོད་ཆེ་བར་ཡང་འགྱུར་ལ། དེའི་ལོངས་སྤྱོད་དེ་དག་ཀྱང་རྒྱལ་པོ་དང་། ཆོམ་རྐུན་དང་། ཆུ་དང་། མེ་དང་བགོ་སྐལ་ལ་སྤྱོད་པའི་མི་མཛའ་བ་རྣམས་ཀྱིས་མི་འཕྲོགས་པ་ཡིན།
en: Their wealth grows greater and their possessions cannot be taken away by the government, thieves, water, fire, or rival kinsmen;

source: སྐྱེ་བོ་མང་པོའི་ཡིད་དུ་འོང་ཞིང་དགའ་བ་ཡིན། དོགས་པ་མེད་པ་ཡིན།
en: they will be liked, favored, and trusted by many beings;

source: ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་དེའི་བསྔགས་པ་བརྗོད་ཅིང་དེ་ལ་ཕ་རོལ་གྱི་གནོད་པས་འཇིགས་པ་མེད་པ་ཡིན།
en: their praises will be sung in the cardinal and intermediate directions; they will have no fear of harm by others;

source: དེའི་སེམས་སྦྱིན་པའི་བགོ་བཤའ་ལ་འཇུག་པ་ཡིན་ཏེ་ལྔ་པོ་དེ་དག་གོ།
en: and their minds will be engaged in the generous attitude of sharing.

source: །མ་བྱིན་པར་ལེན་པ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། དེས་དེ་དེ་བཞིན་གཤེགས་པ་ཉེ་བའི་ཉོན་མོངས་པ་ཅན་མ་ཡིན་པའི་ཡེ་ཤེས་ཅན་དུ་རང་གིས་མངོན་པར་རྟོགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: If the roots of virtue of abandoning stealing are dedicated to unsurpassed and perfect awakening, one will realize the unafflicted wisdom of the thus-gone ones, and thereby fully awaken to unsurpassed and perfect buddhahood.

source: །ཀླུའི་བདག་པོ་འདོད་པས་ལོག་པར་གཡེམ་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་མཁས་པས་བསྔགས་པའི་ཆོས་བཞི་འཐོབ་སྟེ་བཞི་གང་ཞེ་ན།
en: “Nāga Lord, people who abandon sexual misconduct acquire four qualities that earn the praise of the learned. What are these four?

source: དབང་པོ་བསྡམས་པ་དང་། རྒོལ་བ་ལས་ཡང་དག་པར་འདས་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་བསྔགས་པ་དང་། ཆུང་མ་མི་འཕྲོགས་པ་སྟེ་བཞི་པོ་དེ་དག་གོ།
en: The four are as follows: Their senses will be restrained, they will be impervious to criticism, they will be praised by the entire world, and their wives will not be taken from them.

source: །འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། དེས་དེ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་མདོམས་ཀྱི་སྦ་བ་སྦུབས་སུ་ནུབ་པ་འཐོབ་བོ།
en: If the roots of virtue of abandoning sexual misconduct are dedicated to unsurpassed and perfect awakening, they will achieve the mark of a great being such that their private parts are hidden in a sheath.
